/**@file

 @copyright
  INTEL CONFIDENTIAL
  Copyright 2009 - 2018 Intel Corporation.

  The source code contained or described herein and all documents related to the
  source code ("Material") are owned by Intel Corporation or its suppliers or
  licensors. Title to the Material remains with Intel Corporation or its suppliers
  and licensors. The Material may contain trade secrets and proprietary and
  confidential information of Intel Corporation and its suppliers and licensors,
  and is protected by worldwide copyright and trade secret laws and treaty
  provisions. No part of the Material may be used, copied, reproduced, modified,
  published, uploaded, posted, transmitted, distributed, or disclosed in any way
  without Intel's prior express written permission.

  No license under any patent, copyright, trade secret or other intellectual
  property right is granted to or conferred upon you by disclosure or delivery
  of the Materials, either expressly, by implication, inducement, estoppel or
  otherwise. Any license under such intellectual property rights must be
  express and approved by Intel in writing.

  Unless otherwise agreed by Intel in writing, you may not remove or alter
  this notice or any other notice embedded in Materials by Intel or
  Intel's suppliers or licensors in any way.

  This file contains a 'Sample Driver' and is licensed as such under the terms
  of your license agreement with Intel or your vendor. This file may be modified
  by the user, subject to the additional terms of the license agreement.

@par Specification
**/

//
// Name: TbtSetup.uni
//
// Description: AMT Form String Definitions.
//
//**********************************************************************
//**********************************************************************
/=#

#include "VFR.uni"

#langdef   x-AMI "AmiMappingLanguage"           // AMI Mapping Language


#string STR_TBT_FORM                             #language en-US "Thunderbolt(TM) Configuration"
                                                 #language x-AMI "ITBT001"
#string STR_TBT_FORM_HELP                        #language en-US "Thunderbolt(TM) Related Configuration"

#string STR_TBT_OSSELECT_FORM                    #language en-US "Thunderbolt(TM) Enumeration Mode"
                                                 #language x-AMI "ITBT034"
#string STR_TBT_OSSELECT_FORM_HELP               #language en-US "Thunderbolt(TM) Enumeration Related Configuration"

//---------------------------------------------------------------------------
// TBT Configuration
//---------------------------------------------------------------------------
#string STR_TBT_SUPPORT_PROMPT                  #language en-US "Thunderbolt(TM) Support"
                                                #language x-AMI "ITBT002"
#string STR_TBT_SUPPORT_HELP                    #language en-US "Enable or Disable Thunderbolt(TM) Support."

#string STR_TBT_VTD_SECURITY_SETTINGS                  #language en-US "TBT Vt-d base security"
                                                       #language x-AMI "ITBT033"
#string STR_TBT_VTD_SECURITY_SETTINGS_HELP             #language en-US "TBT Vt-d base security"
#string STR_TBT_VTD_SECURITY_ENABLED                   #language en-US "Enable TBT Vt-d base security Device"
#string STR_TBT_VTD_SECURITY_DISABLED                  #language en-US "Disable TBT Vt-d base security Device"
//AMI_OVERRIDE_START - EIP322154 - Remove Thunderbolt DGPU related setup items
#string STR_TBT_X_CONNECT_PROMPT                #language en-US "ThunderBolt X-Connect Support"
                                                #language x-AMI "ITBT006"
#string STR_TBT_X_CONNECT_HELP                  #language en-US "Enable or Disable Thunderbolt X-Connect Support."
//AMI_OVERRIDE_END - EIP322154 - Remove Thunderbolt DGPU related setup items

#string STR_FULLY_DISABLED                      #language eng "Fully Disabled"

#string STR_TBT_PCIE_SUPPORT_PROMPT             #language en-US "Thunderbolt(TM) PCIe Support"
                                                #language x-AMI "ITBT003"
#string STR_TBT_PCIE_SUPPORT_HELP               #language en-US "Enable or Disable Thunderbolt(TM) Support as regular PCIe device."

#string STR_TBT_MULTICONTROLLER_SUPPORT_PROMPT  #language en-US "Multiple TBT controller support"
                                                #language x-AMI "ITBT026"
#string STR_TBT_MULTICONTROLLER_SUPPORT_HELP    #language en-US "Enable or Disable Multiple TBT controller support"

#string STR_TBT_TITAN_RIDGE_OSUP_PROMPT         #language en-US "Titan Ridge Workaround for OSUP"
                                                #language x-AMI "ITBT027"
#string STR_TBT_TITAN_RIDGE_OSUP_HELP           #language en-US "Enable or Disable Titan Ridge Workaround for OSUP"

#string STR_TBT_USB_ON_PROMPT                   #language en-US "Thunderbolt Usb Support"
                                                #language x-AMI "ITBT004"
#string STR_TBT_USB_ON_HELP                     #language en-US "Enabled allows boot from Usb devices which is present behind Thunderbolt"

#string STR_TBT_BOOT_ON_PROMPT                   #language en-US "Thunderbolt Boot Support"
                                                 #language x-AMI "ITBT005"
#string STR_TBT_BOOT_ON_HELP                     #language en-US "Enabled allows boot from Bootable devices which is present behind Thunderbolt"

#string STR_TBT_BOOT_SUPPORT_PROMPT             #language en-US "Thunderbolt(TM) Boot Support"
#string STR_TBT_BOOT_SUPPORT_HELP               #language en-US "Enable or Disable Thunderbolt(TM) attached device as a bootable device."

#string STR_PREBOOTACL                          #language en-US "Pre-Boot ACL"
#string STR_BOOTONCE                            #language en-US "Boot once"

#string STR_ENABLED                             #language en-US "Enabled"
#string STR_DISABLED                            #language en-US "Disabled"

#string STR_TBT_DEVICE_WAKE_UP_SUPPORT_PROMPT   #language en-US "Wake From Thunderbolt(TM) Devices"
                                                #language x-AMI "ITBT00D"
#string STR_TBT_DEVICE_WAKE_UP_SUPPORT_HELP     #language en-US "Enable or disable system wake from Thunderbolt(TM) devices."

#string STR_PCI_CALL_SMI_BEFORE_BOOT            #language en-US "Call pre boot Smi handler"
                                                #language x-AMI "ITBT00M"
#string STR_PCI_CALL_SMI_BEFR_BOOT_HLP          #language en-US "Call TBT Smi Handler before boot to OS bit 0 - TBT, bit 1 - Clean Tree"
#string STR_RESET_HR                            #language en-US "Reset Host router"
#string STR_ENUMERATE_HR                        #language en-US "Enumerate Host router"
#string STR_RESET_ENUMERATE_HR                  #language en-US "Reset and Enumerate Host router"

#string STR_TBT_CACHE_LINE_SIZE_PROMPT          #language en-US "Thunderbolt(TM) PCIe Cache-line Size"
                                                #language x-AMI "ITBT00E"
#string STR_TBT_CACHE_LINE_SIZE_HELP            #language en-US "Cache-line size value to be configured on Thunderbolt(TM) PCIe subtree."
#string STR_TBT_CACHE_LINE_SIZE_000             #language en-US "0"
#string STR_TBT_CACHE_LINE_SIZE_001             #language en-US "1"
#string STR_TBT_CACHE_LINE_SIZE_002             #language en-US "2"
#string STR_TBT_CACHE_LINE_SIZE_004             #language en-US "4"
#string STR_TBT_CACHE_LINE_SIZE_008             #language en-US "8"
#string STR_TBT_CACHE_LINE_SIZE_016             #language en-US "16"
#string STR_TBT_CACHE_LINE_SIZE_032             #language en-US "32"
#string STR_TBT_CACHE_LINE_SIZE_064             #language en-US "64"
#string STR_TBT_CACHE_LINE_SIZE_128             #language en-US "128"

#string STR_TBT_SKIP_PCI_ENUMERATION_PROMPT     #language en-US "Skip PCI enumeration"
                                                #language x-AMI "ITBT00H"
#string STR_TBT_SKIP_PCI_ENUMERATION_HELP       #language en-US "Enable or Disable Boot time PCI enumeration for Thunderbolt(TM) devices"

#string STR_TBT_SKIP_PCI_OPROM_PROMPT           #language en-US "Skip PCI OptionRom"
                                                #language x-AMI "ITBT00I"
#string STR_TBT_SKIP_PCI_OPROM_HELP             #language en-US "Enable or Disable PCI OptionRom loading for Thunderbolt(TM) devices"

#string STR_TBT_SKIP_PCI_INTLINE_PROMPT         #language en-US "Skip PCI Interrupt Assignment"
                                                #language x-AMI "ITBT00J"
#string STR_TBT_SKIP_PCI_INTLINE_HELP           #language en-US "Enable or Disable Boot time PCI interrupt assignment for Thunderbolt(TM) devices"

#string STR_TBT_ACPI_REMOVAL_SUPPORT_PROMPT     #language en-US "ACPI Removal Object Suppport"
                                                #language x-AMI "ITBT00K"
#string STR_TBT_ACPI_REMOVAL_SUPPORT_HELP       #language en-US "Enable or Disable ACPI method _RMV support for Thunderbolt(TM) devices"

#string STR_TBT_SECURITY_LEVEL_PROMPT           #language en-US "Security Level"
                                                #language x-AMI "ITBT00L"
#string STR_TBT_SECURITY_LEVEL_HELP             #language en-US "Security level selection."
#string STR_TBT_MODE0                           #language en-US "No Security"
#string STR_TBT_MODE1                           #language en-US "User Authorization"
#string STR_TBT_MODE2                           #language en-US "Secure Connect" 
#string STR_TBT_MODE3                           #language en-US "Display Port only"
#string STR_TBT_MODE4                           #language en-US "USB Docking Only"

#string STR_PCI_RSRV_MM_PER_PHY_SLT             #language en-US "Reserve mem per phy slot"
                                                #language x-AMI "ITBT00N"
#string STR_PCI_RSRV_MM_PER_PHY_SLT_HELP        #language en-US "If PCIe device consume < ~ MB of memory BIOS will reserve ~ per physical slot"

#string STR_PCI_RSRV_PMM_PER_PHY_SLT            #language en-US "Reserve P mem per phy slot"
                                                #language x-AMI "ITBT00O"
#string STR_PCI_RSRV_PMM_PER_PHY_SLT_HELP       #language en-US "If PCIe device consume < ~ MB of P memory BIOS will reserve ~ per physical slot"

#string STR_PCI_RSRV_IO_PER_PHY_SLT             #language en-US "Reserve IO per phy slot"
                                                #language x-AMI "ITBT00P"
#string STR_PCI_RSRV_IO_PER_PHY_SLT_HELP        #language en-US "If PCIe device consume < ~ KB of IO space BIOS will reserve ~ per physical slot"

#string STR_PCI_IGNORE_OP_ROM                   #language en-US "Ignore OpROM for TBT"
#string STR_PCI_IGNORE_OP_ROM_HELP              #language en-US "Ignore OpROM for PCIe devices behind TBT"

#string STR_PCI_ASSIGN_IO                       #language en-US "Assign IO"
                                                #language x-AMI "ITBT00Q"
#string STR_PCI_ASSIGN_IO_HELP                  #language en-US "Assign IO resource to TBT"

#string STR_PCI_MORE_IO_FOR_PORTS               #language en-US "More IO for ports"
                                                #language x-AMI "ITBT00R"
#string STR_PCI_MORE_IO_FOR_PORTS_HELP          #language en-US "Assign more IO to ports 3/4 or 5/6"
#string STR_PCI_MORE_IO_FOR_PORTS_34            #language en-US "3 and 4"
#string STR_PCI_MORE_IO_FOR_PORTS_56            #language en-US "5 and 6"

#string STR_PCI_ASSIGN_PMEM                      #language en-US "Assign Prefetchable Memory"
                                                 #language x-AMI "ITBT00S"
#string STR_PCI_ASSIGN_PMEM_HELP                 #language en-US "Assign Prefetchable Memory to TBT"

#string STR_PCI_HOT_PLUG_SCI                    #language en-US "TBT hot-plug SCI"
#string STR_PCI_HOT_PLUG_SCI_HELP               #language en-US "Enable/Disable SCI on TBT hot-plug"

#string STR_PCI_HOT_PLUG_SW_SMI                 #language en-US "    SW SMI on TBT hot-plug"
                                                #language x-AMI "ITBT00U"
#string STR_PCI_HOT_PLUG_SW_SMI_HELP            #language en-US "When enabled, BIOS generates software SMI to assign resource to TBT devices"
#string STR_PCI_HOT_PLUG_SW_SMI_NO_CHNG         #language en-US "Take from CMOS"

#string STR_PCI_GPIO5_FILTER                    #language en-US "GPIO filter"
                                                #language x-AMI "ITBT00V"
#string STR_PCI_GPIO5_FILTER_HELP               #language en-US "GPIO filter is needed to avoid electrical noise on PCH GPIOs during hotplug of 12V USB devices"

#string STR_PCI_HOT_PLUG_NOTIFY                 #language en-US "    ACPI Notify on TBT Hot-plug"
                                                #language x-AMI "ITBT00W"
#string STR_PCI_HOT_PLUG_NOTIFY_HELP            #language en-US "When enabled, BIOS generates ACPI Notify"

#string STR_PCI_MSI_ENABLED_IN_FADT             #language en-US "MSI enabled in FADT"
                                                #language x-AMI "ITBT00X"
#string STR_PCI_MSI_ENABLED_IN_FADT_HELP        #language en-US "When disabled, MSI support is disabled in FADT"

#if 0
#string STR_PCI_TBT_SELECTOR_RVP3               #language en-US "TBT Root port Selector"
                                                #language x-AMI "ITBT011"
#string STR_PCI_TBT_SELECTOR_RVP7               #language en-US "TBT Root port Selector"
                                                #language x-AMI "ITBT012"
#string STR_PCI_TBT_SELECTOR1_RVP7              #language en-US "TBT Root port Selector"						
                                                #language x-AMI "ITBT029"
#string STR_PCI_TBT_SELECTOR_SDS                #language en-US "TBT Root port Selector"
                                                #language x-AMI "ITBT013"
#string STR_PCI_TBT_SELECTOR_DT_HALO            #language en-US "TBT Root port Selector"
                                                #language x-AMI "ITBT014"
#string STR_PCI_TBT_SELECTOR_HELP               #language en-US "Enable Port on which Thuderbolt is configured. AUTO will set the default Port for each platform."
#endif
// AMI_OVERRIDE_START - Enable all PCI host for TBT feature
// AMI_OVERRIDE_START - EIP295619 Avoid duplicate mapping ID usage
#string STR_TBT_HOST_LOCATION_GROUP_PROMPT      #language en-US "AIC Location Group"
                                                #language x-AMI "ITBT015"
#string STR_TBT_HOST_LOCATION_GROUP_HELP        #language en-US "Thunderbolt AIC Location Group"
#string STR_TBT_HOST_LOCATION_GROUP_000         #language en-US "SB PCIE Slot"
#string STR_TBT_HOST_LOCATION_GROUP_001         #language en-US "CPU0 NB PCIE Slot"
#string STR_TBT_HOST_LOCATION_GROUP_002         #language en-US "CPU1 NB PCIE Slot"
#string STR_TBT_HOST_LOCATION_GROUP_003         #language en-US "CPU2 NB PCIE Slot"
#string STR_TBT_HOST_LOCATION_GROUP_004         #language en-US "CPU3 NB PCIE Slot"

#string STR_TBT_HOST_LOCATION_SB_PROMPT         #language en-US "AIC Location"
                                                #language x-AMI "ITBT016"
#string STR_TBT_HOST_LOCATION_SB_HELP           #language en-US "Thunderbolt AIC Location"
#string STR_TBT_HOST_LOCATION_SB_000            #language en-US "SB PCIE D28F0"
#string STR_TBT_HOST_LOCATION_SB_001            #language en-US "SB PCIE D28F1"
#string STR_TBT_HOST_LOCATION_SB_002            #language en-US "SB PCIE D28F2"
#string STR_TBT_HOST_LOCATION_SB_003            #language en-US "SB PCIE D28F3"
#string STR_TBT_HOST_LOCATION_SB_004            #language en-US "SB PCIE D28F4"
#string STR_TBT_HOST_LOCATION_SB_005            #language en-US "SB PCIE D28F5"
#string STR_TBT_HOST_LOCATION_SB_006            #language en-US "SB PCIE D28F6"
#string STR_TBT_HOST_LOCATION_SB_007            #language en-US "SB PCIE D28F7"
#string STR_TBT_HOST_LOCATION_SB_008            #language en-US "SB PCIE D29F0"
#string STR_TBT_HOST_LOCATION_SB_009            #language en-US "SB PCIE D29F1"
#string STR_TBT_HOST_LOCATION_SB_010            #language en-US "SB PCIE D29F2"
#string STR_TBT_HOST_LOCATION_SB_011            #language en-US "SB PCIE D29F3"
#string STR_TBT_HOST_LOCATION_SB_012            #language en-US "SB PCIE D29F4"
#string STR_TBT_HOST_LOCATION_SB_013            #language en-US "SB PCIE D29F5"
#string STR_TBT_HOST_LOCATION_SB_014            #language en-US "SB PCIE D29F6"
#string STR_TBT_HOST_LOCATION_SB_015            #language en-US "SB PCIE D29F7"
#string STR_TBT_HOST_LOCATION_SB_016            #language en-US "SB PCIE D27F0"
#string STR_TBT_HOST_LOCATION_SB_017            #language en-US "SB PCIE D27F1"
#string STR_TBT_HOST_LOCATION_SB_018            #language en-US "SB PCIE D27F2"
#string STR_TBT_HOST_LOCATION_SB_019            #language en-US "SB PCIE D27F3"
#string STR_TBT_HOST_LOCATION_SB_020            #language en-US "SB PCIE D27F4"
#string STR_TBT_HOST_LOCATION_SB_021            #language en-US "SB PCIE D27F5"
#string STR_TBT_HOST_LOCATION_SB_022            #language en-US "SB PCIE D27F6"
#string STR_TBT_HOST_LOCATION_SB_023            #language en-US "SB PCIE D27F7"

#string STR_TBT_HOST_LOCATION_NB_PROMPT         #language en-US "AIC Location"
                                                #language x-AMI "ITBT01E"
#string STR_TBT_HOST_LOCATION_NB_HELP           #language en-US "Thunderbolt AIC Location"
#string STR_TBT_HOST_LOCATION_NB_000            #language en-US "NB PCIE D01F0"
#string STR_TBT_HOST_LOCATION_NB_001            #language en-US "NB PCIE D01F1"
#string STR_TBT_HOST_LOCATION_NB_002            #language en-US "NB PCIE D01F2"
#string STR_TBT_HOST_LOCATION_NB_004            #language en-US "NB PCIE D02F0"
#string STR_TBT_HOST_LOCATION_NB_005            #language en-US "NB PCIE D02F1"
#string STR_TBT_HOST_LOCATION_NB_006            #language en-US "NB PCIE D02F2"
#string STR_TBT_HOST_LOCATION_NB_007            #language en-US "NB PCIE D02F3"
#string STR_TBT_HOST_LOCATION_NB_008            #language en-US "NB PCIE D03F0"
#string STR_TBT_HOST_LOCATION_NB_009            #language en-US "NB PCIE D03F1"
#string STR_TBT_HOST_LOCATION_NB_010            #language en-US "NB PCIE D03F2"
#string STR_TBT_HOST_LOCATION_NB_011            #language en-US "NB PCIE D03F3"

#string STR_TBT_HOST_LOCATION_PROMPT            #language en-US "AIC Location"
                                                #language x-AMI "ITBT01F"
#string STR_TBT_HOST_LOCATION_HELP              #language en-US "Thunderbolt AIC Location"
// AMI_OVERRIDE_END - EIP295619 Avoid duplicate mapping ID usage
// AMI_OVERRIDE_END - Enable all PCI host for TBT feature

#string STR_AUTO                                #language en-US "AUTO"
#string STR_TBT_PCIERP1_PROMPT                  #language en-US "PCH-PCI Express Root Port 1" 
#string STR_TBT_PCIERP2_PROMPT                  #language en-US "PCH-PCI Express Root Port 2" 
#string STR_TBT_PCIERP3_PROMPT                  #language en-US "PCH-PCI Express Root Port 3" 
#string STR_TBT_PCIERP4_PROMPT                  #language en-US "PCH-PCI Express Root Port 4" 
#string STR_TBT_PCIERP5_PROMPT                  #language en-US "PCH-PCI Express Root Port 5" 
#string STR_TBT_PCIERP6_PROMPT                  #language en-US "PCH-PCI Express Root Port 6" 
#string STR_TBT_PCIERP7_PROMPT                  #language en-US "PCH-PCI Express Root Port 7" 
#string STR_TBT_PCIERP8_PROMPT                  #language en-US "PCH-PCI Express Root Port 8"
#string STR_TBT_PCIERP9_PROMPT                  #language en-US "PCH-PCI Express Root Port 9" 
#string STR_TBT_PCIERP10_PROMPT                 #language en-US "PCH-PCI Express Root Port 10" 
#string STR_TBT_PCIERP11_PROMPT                 #language en-US "PCH-PCI Express Root Port 11" 
#string STR_TBT_PCIERP12_PROMPT                 #language en-US "PCH-PCI Express Root Port 12" 
#string STR_TBT_PCIERP13_PROMPT                 #language en-US "PCH-PCI Express Root Port 13" 
#string STR_TBT_PCIERP14_PROMPT                 #language en-US "PCH-PCI Express Root Port 14" 
#string STR_TBT_PCIERP15_PROMPT                 #language en-US "PCH-PCI Express Root Port 15" 
#string STR_TBT_PCIERP16_PROMPT                 #language en-US "PCH-PCI Express Root Port 16"
#string STR_TBT_PCIERP17_PROMPT                 #language en-US "PCH-PCI Express Root Port 17" 
#string STR_TBT_PCIERP18_PROMPT                 #language en-US "PCH-PCI Express Root Port 18" 
#string STR_TBT_PCIERP19_PROMPT                 #language en-US "PCH-PCI Express Root Port 19" 
#string STR_TBT_PCIERP20_PROMPT                 #language en-US "PCH-PCI Express Root Port 20" 
#string STR_TBT_PEGRP0_PROMPT                   #language en-US "PEG Root Port 0"
#string STR_TBT_PEGRP1_PROMPT                   #language en-US "PEG Root Port 1"
#string STR_TBT_PEGRP2_PROMPT                   #language en-US "PEG Root Port 2"

#string STR_PCI_TBT_HOSTROUTER                  #language en-US "TBT Host Router"
                                                #language x-AMI "ITBT017"
#string STR_PCI_TBT_HOSTROUTER_HELP             #language en-US "Enable the host router based on ports available."
#string STR_PCI_TBT_ONEPORT_PROMPT              #language en-US "One port"
#string STR_PCI_TBT_TWOPORT_PROMPT              #language en-US "Two port"

#string STR_PCI_GPIO3_FORCE_PWR                 #language en-US "GPIO3 Force Pwr"
                                                #language x-AMI "ITBT00F"
#string STR_PCI_GPIO3_FORCE_PWR_HELP            #language en-US "Set GPIO3 to 1/0"

#string STR_PCI_GPIO3_FORCE_PWR1                 #language en-US "GPIO3 Force Pwr for RP05"
                                                 #language x-AMI "ITBT028"
#string STR_PCI_GPIO3_FORCE_PWR1_HELP            #language en-US "Set GPIO3 to 1/0"

//AMI_OVERRIDE_START >>> EIP342898 : Correct the description of "Enable CLK REQ" in Setup Page
#string STR_PCI_TBT_CLKREQ                      #language en-US "Enable CLK REQ"
                                                #language x-AMI "ITBT00Y"
#string STR_PCI_TBT_CLKREQ_HELP                 #language en-US "Enable clock request (CLKREQ#) for all upstream ports"
//AMI_OVERRIDE_END <<< EIP342898 : Correct the description of "Enable CLK REQ" in Setup Page

#string STR_PCI_GPIO3_FORCE_PWR_DLY             #language en-US "Wait time in ms after applying Force Pwr"
                                                #language x-AMI "ITBT00G"
#string STR_PCI_GPIO3_FORCE_PWR_DLY_HELP        #language en-US "After Force Pwr is asserted the wait time (in milli seconds) before access the TBT controller"

#string STR_PCI_TBT_ASPM                        #language en-US "Enable ASPM"
                                                #language x-AMI "ITBT00Z"
#string STR_PCI_TBT_ASPM_HELP                   #language en-US "Enable ASPM support for all the downstreams ports and endpoints devices"

#string STR_PCI_TBT_LTR                         #language en-US "Enable LTR"
                                                #language x-AMI "ITBT010"
#string STR_PCI_TBT_LTR_HELP                    #language en-US "Enable Latency Tolerance Reporting support for all the Thunderbolt(TM) devices"

#string STR_TBT_PCIE_RBUS_PROMPT                #language en-US "Extra Bus Reserved"
                                                #language x-AMI "ITBT018"
#string STR_TBT_PCIE_RBUS_HELP                  #language en-US "Extra Bus Reserved 56-One port Host,106-Two port Host."
#string STR_TBT_PCIE_RMEM_PROMPT                #language en-US "Reseved Memory"
                                                #language x-AMI "ITBT019"
#string STR_TBT_PCIE_RMEM_HELP                  #language en-US "Reserved Memory for this Root Bridge (1-4096) MB"
#string STR_TBT_PCIE_RMEM_ADDRRNGMAX            #language en-US "Memory Alignment"
                                                #language x-AMI "ITBT01A"
#string STR_TBT_PCIE_RMEM_RNG_HELP              #language en-US "Memory Alignment (0-31 bits)"
#string STR_TBT_PCIE_RPMEM_PROMPT               #language en-US "Reserved PMemory"
                                                #language x-AMI "ITBT01B"
#string STR_TBT_PCIE_RPMEM_HELP                 #language en-US "Reserved Prefetchable Memory for this Root Bridge (1-4096) MB"
#string STR_TBT_PCIE_RPMEM_ADDRRNGMAX           #language en-US "PMemory Alignment"
                                                #language x-AMI "ITBT01C"
#string STR_TBT_PCIE_RPMEM_RNG_HELP             #language en-US "PMemory Alignment (0-31 bits)"
#string STR_TBT_PCIE_RVIO_PROMPT                #language en-US "Reserved I/O"
                                                #language x-AMI "ITBT01D"
#string STR_TBT_PCIE_RVIO_HELP                  #language en-US "Reserved I/O (4K/8K/12K/16K/20K) Range for this Root Bridge."

#string STR_TBT_WIN10_SUPPORT_PROMPT            #language en-US "Thunderbolt(TM) Enumeration Mode"
                                                #language x-AMI "ITBT02A"
#string STR_PCI_WIN10_SUPPORT_ENABLE            #language en-US "Native"
#string STR_PCI_WIN10_SUPPORT_DISABLE           #language en-US "Legacy"
#string STR_PCI_WIN10_SUPPORT_UNKNOWN           #language en-US "Unknown"
#string STR_PCI_WIN10_SUPPORT_RTD3              #language en-US "Native with low power support"
#string STR_TBT_WIN10_SUPPORT_HELP              #language en-US "Specify Thunderbolt(TM) Enumeration Mode.\n"
                                                                "\n"
                                                                "Legacy: BIOS enumerates Thunderbolt(TM) devices.\n"
                                                                "\n"
                                                                "Native: OS enumerates Thunderbolt(TM) devices.\n"
                                                                "\n"
                                                                "Native with low power support: OS enumerates Thunderbolt(TM) devices. Requires HW support for RTD3."
//AMI_OVERRIDE_START - EIP296758 Implement Intel document 563778, version 2
#string STR_TBT_WA_SWITCH_PROMPT                #language en-US "Alpine Ridge Workaround Select"
                                                #language x-AMI "ITBT020"
#string STR_TBT_WA_SWITCH_HELP                  #language en-US "Intel Technical Advisory #563778: Using Non-LTR Capable PCIe Devices with Alpine Ridge"
#string STR_TBT_WA                              #language en-US "WA Rev 1"
#string STR_TBT_NEW_WA                          #language en-US "WA Rev 2-New WA"
#string STR_NEW_WA_PRE_WAKE_PROMPT              #language en-US "AR XHCI Host Pre-wake"
                                                #language x-AMI "ITBT021"
#string STR_NEW_WA_PRE_WAKE_HELP                #language en-US "Alpine Ridge XHCI Pre-wake Enabled or Disabled."
#string STR_NEW_WA_ACTIVE_LTR_PROMPT            #language en-US "AR XHCI Host Active LTR"
                                                #language x-AMI "ITBT022"
#string STR_NEW_WA_ACTIVE_LTR_HELP              #language en-US "Alpine Ridge XHCI Active LTR allow 1~1023 ms."
#string STR_NEW_WA_HIGH_LTR_PROMPT              #language en-US "AR XHCI Host High LTR"
                                                #language x-AMI "ITBT023"
#string STR_NEW_WA_HIGH_LTR_HELP                #language en-US "Alpine Ridge XHCI High LTR allow 3~124 ms."
#string STR_NEW_WA_MEDIUM_LTR_PROMPT            #language en-US "AR XHCI Host Medium LTR"
                                                #language x-AMI "ITBT024"
#string STR_NEW_WA_MEDIUM_LTR_HELP              #language en-US "Alpine Ridge XHCI Medium LTR allow 2~123 ms."
#string STR_NEW_WA_LOW_LTR_PROMPT               #language en-US "AR XHCI Host Low LTR"
                                                #language x-AMI "ITBT025"
#string STR_NEW_WA_LOW_LTR_HELP                 #language en-US "Alpine Ridge XHCI Low LTR allow 1~122 ms."
//AMI_OVERRIDE_END - EIP296758 Implement Intel document 563778, version 2

//AMI_OVERRIDE_START >>> EIP353107 : Boot On command has the fail rate
#string STR_TBT_BEFORE_BOOT_ON_CMD_DELAY_PROMPT #language en-US "Thunderbolt delay before BOOT_ON Command in PEI phase"
                                                #language x-AMI "ITBT030"
#string STR_TBT_BEFORE_BOOT_ON_CMD_DELAY_HELP   #language en-US "Delay allow 0 ~ 65535 ms."
#string STR_TBT_BEFORE_USB_ON_CMD_DELAY_PROMPT  #language en-US "Thunderbolt delay before USB_ON Command in PEI phase"
                                                #language x-AMI "ITBT031"
#string STR_TBT_BEFORE_USB_ON_CMD_DELAY_HELP    #language en-US "Delay allow 0 ~ 65535 ms."
#string STR_TBT_BEFORE_SX_EXIT_CMD_DELAY_PROMPT #language en-US "Thunderbolt delay before SX_EXIT Command in PEI phase"
                                                #language x-AMI "ITBT032"
#string STR_TBT_BEFORE_SX_EXIT_CMD_DELAY_HELP   #language en-US "Delay allow 0 ~ 65535 ms."
//AMI_OVERRIDE_END <<< EIP353107 : Boot On command has the fail rate

// ***Don't modify this line, its automatically generated.?#033#!***